app/Controllers/Pelicula.php

SELECT *
FROM `peliculas`
---
    public function index()
    {

        $peliculaModel = new PeliculaModel();

        $data = $peliculaModel->findAll();

SELECT *
FROM `peliculas`
WHERE `peliculas`.`id` = '1'
---
    public function edit($id){
        $peliculaModel = new PeliculaModel();
        return View('/pelicula/edit',['pelicula'=>$peliculaModel->find($id)]);

DELETE FROM `peliculas`
WHERE `id` IN ('5')
---
    public function delete($id){
        $peliculaModel = new PeliculaModel();
        $peliculaModel->delete($id);

INSERT INTO `peliculas` (`titulo`, `descripcion`) VALUES ('Los pochos', 'Unos locos se fueron en bici por el borde de la montaña, pero alto, bien en el precicipicio. Murieron todos')
---
    public function create(){

        $peliculaModel = new PeliculaModel();
        $data=[
            'titulo'=> $this->request->getPost('titulo'),
            'descripcion'=> $this->request->getPost('descripcion')
        ];
        $peliculaModel->insert($data);